#Код Морзе для представления цифр и букв использует тире и точки. Напишите
#функцию для кодирования текстового сообщения в соответствии с кодом Морзе.
#(словари в помощь)


def text_to_morse(text: str) -> str:
    morse_data = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
            'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.',
            'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
            'Y': '-.--', 'Z': '--..', '0': '-----', '1': '.----', '2': '..---', '3': '...--', '4': '....-',
            '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.', " ": " "}
    morse: str = ''
    for letter in text.upper():
        if letter in morse_data:
            morse += morse_data[letter] + " "
    return morse

#print(text_to_morse("hello world"))

def morse_to_text(morse: str) -> str:
    morse_data = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
            'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.',
            'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
            'Y': '-.--', 'Z': '--..', '0': '-----', '1': '.----', '2': '..---', '3': '...--', '4': '....-',
            '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.', " ": " "}
#    morse = morse.replase("   ", " | ")
    morse = morse.split()
    text: str = ""
    for letter in morse:
        for key, value in morse_data.items():
            if letter == value:
                text += key
                break
            elif letter == "|":
                text += " "
                break
    return text

print(morse_to_text(text_to_morse("hello world")))